Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/26/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-VCek8XBQmrVSGpXa

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.react-starter-vite.helm_release.react-starter-vite: Refreshing state... [id=react-starter-vite]
module.kubernetes.module.grafana.helm_release.grafana-agent: Refreshing state... [id=grafana-agent]
module.kubernetes.module.traefik.helm_release.traefik: Refreshing state... [id=traefik]
module.kubernetes.module.whoami.helm_release.whoami: Refreshing state... [id=whoami]
module.kubernetes.module.grafana.helm_release.grafana: Refreshing state... [id=grafana]
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_1: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-namespace: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_2: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.persistent-volume-3Gi_3: Refreshing state...
module.kubernetes.module.storage.kubernetes_manifest.local-storage-class: Refreshing state...
module.kubernetes.module.test-server.helm_release.test-server: Refreshing state... [id=test-server]
module.kubernetes.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.kubernetes.module.grafana.helm_release.loki: Refreshing state... [id=loki]
module.kubernetes.module.grafana.helm_release.promtail: Refreshing state... [id=promtail]
module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress-middleware: Refreshing state...
module.kubernetes.module.prometheus.kubernetes_manifest.prometheus-ingress: Refreshing state...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.kubernetes.module.grafana.helm_release.grafana-agent will be updated in-place
  ~ resource "helm_release" "grafana-agent" {
        id                         = "grafana-agent"
      ~ metadata                   = [
          - {
              - app_version = "v0.37.4"
              - chart       = "grafana-agent"
              - name        = "grafana-agent"
              - namespace   = "grafana"
              - revision    = 2
              - values      = jsonencode(
                    {
                      - agent   = {
                          - configMap    = {
                              - content = <<-EOT
                                    faro.receiver "default" {
                                      output {
                                          logs   = [loki.write.default.receiver]
                                      }
                                    }
                                    
                                    loki.write "default" {
                                        endpoint {
                                            url = "http://loki-gateway/loki/api/v1/push"
                                        }
                                    }
                                EOT
                            }
                          - uiPathPrefix = "/agent-grafana"
                        }
                      - ingress = {
                          - enabled = true
                          - hosts   = [
                              - "gently-concise-dogfish.ngrok-free.app",
                            ]
                          - path    = "/faro"
                        }
                    }
                )
              - version     = "0.27.2"
            },
        ] -> (known after apply)
        name                       = "grafana-agent"
      ~ values                     = [
          - <<-EOT
                agent:
                  configMap:
                    content: |
                      faro.receiver "default" {
                        output {
                            logs   = [loki.write.default.receiver]
                        }
                      }
                
                      loki.write "default" {
                          endpoint {
                              url = "http://loki-gateway/loki/api/v1/push"
                          }
                      }
                  uiPathPrefix: "/agent-grafana"
                ingress:
                  enabled: true
                  hosts: ["gently-concise-dogfish.ngrok-free.app"]
                  path: "/faro"
            EOT,
          + <<-EOT
                agent:
                  configMap:
                    content: |
                      faro.receiver "default" {
                        output {
                            logs   = [loki.write.default.receiver]
                        }
                      }
                
                      loki.write "default" {
                          endpoint {
                              url = "http://loki-gateway/loki/api/v1/push"
                          }
                      }
                  uiPathPrefix: "/agent-grafana"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-agent-ingress will be updated in-place
  ~ resource "kubernetes_manifest" "grafana-agent-ingress" {
      ~ manifest = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind     = "Rule"
                        match    = "PathPrefix(`/agent-grafana`)"
                        services = [
                            {
                                name = "grafana-agent"
                                port = 80
                            },
                        ]
                    },
                  + {
                      + kind     = "Rule"
                      + match    = "PathPrefix(`/faro-grafana`)"
                      + services = [
                          + {
                              + name = "grafana-faro"
                              + port = 80
                            },
                        ]
                    },
                ]
                # (1 unchanged attribute hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ routes      = [
                    {
                        kind        = "Rule"
                        match       = "PathPrefix(`/agent-grafana`)"
                        middlewares = null
                        priority    = null
                        services    = [
                            {
                                kind               = null
                                name               = "grafana-agent"
                                namespace          = null
                                nativeLB           = null
                                passHostHeader     = null
                                port               = "80"
                                responseForwarding = {
                                    flushInterval = null
                                }
                                scheme             = null
                                serversTransport   = null
                                sticky             = {
                                    cookie = {
                                        httpOnly = null
                                        name     = null
                                        sameSite = null
                                        secure   = null
                                    }
                                }
                                strategy           = null
                                weight             = null
                            },
                        ]
                    },
                  + {
                      + kind        = "Rule"
                      + match       = "PathPrefix(`/faro-grafana`)"
                      + middlewares = (known after apply)
                      + priority    = (known after apply)
                      + services    = [
                          + {
                              + kind               = (known after apply)
                              + name               = "grafana-faro"
                              + namespace          = (known after apply)
                              + nativeLB           = (known after apply)
                              + passHostHeader     = (known after apply)
                              + port               = "80"
                              + responseForwarding = {
                                  + flushInterval = (known after apply)
                                }
                              + scheme             = (known after apply)
                              + serversTransport   = (known after apply)
                              + sticky             = {
                                  + cookie = {
                                      + httpOnly = (known after apply)
                                      + name     = (known after apply)
                                      + sameSite = (known after apply)
                                      + secure   = (known after apply)
                                    }
                                }
                              + strategy           = (known after apply)
                              + weight             = (known after apply)
                            },
                        ]
                    },
                ]
                # (2 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.kubernetes.module.grafana.kubernetes_manifest.grafana-faro-svc will be created
  + resource "kubernetes_manifest" "grafana-faro-svc" {
      + manifest = {
          + apiVersion = "v1"
          + kind       = "Service"
          + metadata   = {
              + name      = "grafana-faro"
              + namespace = "grafana"
            }
          + spec       = {
              + ports    = [
                  + {
                      + name       = "http-faro"
                      + port       = 80
                      + protocol   = "TCP"
                      + targetPort = 12347
                    },
                ]
              + selector = {
                  + "app.kubernetes.io/instance" = "grafana-agent"
                  + "app.kubernetes.io/name"     = "grafana-agent"
                }
            }
        }
      + object   = {
          + apiVersion = "v1"
          + kind       = "Service"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "grafana-faro"
              + namespace                  = "grafana"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + allocateLoadBalancerNodePorts = (known after apply)
              + clusterIP                     = (known after apply)
              + clusterIPs                    = (known after apply)
              + externalIPs                   = (known after apply)
              + externalName                  = (known after apply)
              + externalTrafficPolicy         = (known after apply)
              + healthCheckNodePort           = (known after apply)
              + internalTrafficPolicy         = (known after apply)
              + ipFamilies                    = (known after apply)
              + ipFamilyPolicy                = (known after apply)
              + loadBalancerClass             = (known after apply)
              + loadBalancerIP                = (known after apply)
              + loadBalancerSourceRanges      = (known after apply)
              + ports                         = [
                  + {
                      + appProtocol = (known after apply)
                      + name        = "http-faro"
                      + nodePort    = (known after apply)
                      + port        = 80
                      + protocol    = "TCP"
                      + targetPort  = "12347"
                    },
                ]
              + publishNotReadyAddresses      = (known after apply)
              + selector                      = {
                  + "app.kubernetes.io/instance" = "grafana-agent"
                  + "app.kubernetes.io/name"     = "grafana-agent"
                }
              + sessionAffinity               = (known after apply)
              + sessionAffinityConfig         = {
                  + clientIP = {
                      + timeoutSeconds = (known after apply)
                    }
                }
              + type                          = (known after apply)
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>